Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: བདེ་གཤེགས་མི་ཟླ་ཕྲེང་རྒྱུད་མཁན་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ངེས་པར་སེམས་དེ་ལ། །ཨུད་པ་ལ་ཡི་ཕྲེང་བ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Manujacandra, when the son of a garland maker, Offered a garland of utpalas To the thus-gone Certain Mind And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་གཟིགས་པ་ནི། །འདུན་དཔོན་ཚེ་ན་དེ་བཞིན་གཤེགས་པ་པོ། །བདེན་པར་གསུང་བ་དེ་ལ་ཕྲེང་བ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sudarśana, when a chief councillor, Offered a garland To the thus-gone Truthful Speech And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རབ་བརྒྱན་གྲོང་ཁྱེར་ལ་རྟེན་པའི། །བུར་གྱུར་ཚེ་ན་བདེ་གཤེགས་མདངས་འོད་ཀྱི། །གྲོང་ཁྱེར་སྒོ་དག་མཛེས་པར་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Pratimaṇḍita, when the son of a city beggar, Decorated the city gates For the well-gone Bright Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ནོར་འོད་བརྒྱ་བྱིན་གྱུར་པའི་ཚེ། །བདེ་གཤེགས་གཟི་བརྗིད་མེ་ཏོག་རྒྱས་པ་ལ། །དཔག་ཚད་ཁོར་ཡུག་མེ་ཏོག་ཆར་ཕབ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Maṇiprabha, when Śakra, Let a rain of flowers fall across one league For the well-gone Blooming Flower of Splendor And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འབྱུང་གནས་ཀྱིས། །བདེ་གཤེགས་གྲགས་ཏོག་ཤེས་རབ་ཕ་རོལ་ཕྱིན། །གསུང་ཚེ་ལེགས་གསུངས་ཞེས་ནི་ཡི་རང་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Dharmākara Called out ‘Excellent!’ When the well-gone Banner of Fame was teaching the perfection of insight, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དོན་ངེས་ལྡན་པ་ཐ་ག་པར། །གྱུར་ཚེ་བདེ་གཤེགས་ཡོན་ཏན་གསལ་བ་ལ། །རས་ཀྱི་ཁ་ཚར་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Arthaviniścita, when a weaver, Offered woven tassels To the well-gone Luminous Qualities And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚེམས་སྦྱིན་བློ་ཆེན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྒྲོན་དེ་ལ། །བསིལ་ཡབ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Harṣadatta, when the son of a chief minister, Offered a fan To the thus-gone Dharma Lamp And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་འབྱུང་གནས་གཞུ་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་གསལ་རབ་དཔལ་དེ་ལ། །མེ་ཏོག་སྙིམ་པ་བཀང་སྟེ་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnākara, when an arrow maker, Scattered two handfuls of flowers To the thus-gone Glory of Highest Clarity And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྐྱེ་དབང་མཚུངས་པ་རྫ་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཞལ་སྡུག་སྡེ་བདག་ལ། །སྣོད་དག་ཆུ་ཡིས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Janendrakalpa, when a potter, Offered vessels filled with water To the thus-gone Lord of Those of Beautiful Countenance And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྟབས་གཤེགས་ཞིང་པའི་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་སེང་གེའི་སྟབས་བཞུད་ལ། །ཟམ་སྟེགས་དག་ནི་གཟུགས་པ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vikrāntagāmin, when a farmer’s son, Made bridges For the thus-gone Lion Gait And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བློ་གནས་ཤིང་སྲུངས་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྐྱེ་བོའི་མཆོད་རྟེན་ལ། །སེའུ་འབྲུ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sthitabuddhi, when the son of a forest guard, Offered pomegranates To the thus-gone Stūpa for Humanity And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གདུགས་མཛེས་བློན་པོའི་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྒྱ་མཚོའི་བློ་དེ་ལ། །ཙམ་པའི་མེ་ཏོག་ཕྲེང་བ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vibhrājacchattra, when the son of a minister, Offered a garland of campa flowers To the thus-gone Ocean Mind And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་གཙོ་བོ་གསེར་མགར་ཚེ། །དེ་བཞིན་གཤེགས་པ་པད་མའི་སྙིང་པོ་ལ། །བདུག་པས་བདུགས་པའི་མེ་ཏོག་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Jyeṣṭha, when a goldsmith, Scattered scented flowers For the thus-gone Lotus Essence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཤིན་ཏུ་འཕགས་དཔལ་སྤོས་འཚོང་བུར། །གྱུར་ཚེ་དེ་བཞིན་གཤེགས་པ་གདུགས་སྡེ་ཡི། །འཆག་ས་སྤོས་ཆུས་ཆག་ཆག་བཏབ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Abhyudgataśrī, when the son of an incense merchant, Sprinkled fragrant water on a monastic walkway For the thus-gone Cluster of Parasols And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་གེའི་སྒྲ་ནི་རྔ་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་སཱ་ལའི་རྒྱལ་པོ་ལ། །རྔ་བོ་ཆེ་དག་བརྡུང་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃhaghoṣa, when a drummer, Beat great drums For the thus-gone King of Sāla Trees And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྣམ་རོལ་ལྡན་པ་དུང་འབུད་མཁན། །གྱུར་ཚེ་བདེ་གཤེགས་ཉི་མའི་སྙིང་པོ་དེ། །གྲོང་ཁྱེར་གཤེགས་ཚེ་དུང་དག་བུས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ།། །།
en: “The well-gone Vikrīḍitāvin, when a conch blower, Blew conches when the well-gone Sun Essence Entered a city And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཀླུ་འོད་ཟླ་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་དགའ་དེ་ལ། །རྔ་བོ་ཆེ་དག་བརྡུང་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Nāgaprabhāsa, when he was Candra, Beat great drums For the thus-gone Joy of Awakening And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མེ་ཏོག་རི་བོ་གར་མཁན་བུར། །གྱུར་ཚེ་བདེ་གཤེགས་དབང་པོ་ཞི་དེ་ཡི། །སྤྱན་སྔར་བྲོ་གར་དག་གིས་མཆོད་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Kusumaparvata, when the son of a dancer, Offered worship through dance To the well-gone Serene Faculties And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཀླུ་དགའ་གར་མཁན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཉི་མའི་འོད་དེ་ལ། །རོལ་མོའི་སྒྲ་དག་བསྒྲགས་པ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Nāganandin, when the son of a dancer, Played melodious music For the thus-gone Sunlight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྤོས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོ་ཡི། །སྲས་མོར་གྱུར་ཚེ་དེ་བཞིན་གཤེགས་པ་པོ། །པད་དཀར་སྤོས་ལ་མུ་ཏིག་རྒྱན་ཕྲེང་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Gandheśvara, when a princess, Offered a pearl garland To the thus-gone White Lotus Fragrance And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཤིན་ཏུ་གྲགས་པ་ཚོང་དཔོན་གྱི། །ཆུང་མར་གྱུར་ཚེ་དེ་བཞིན་གཤེགས་པ་པོ། །ལྷུན་པོའི་འོད་ཟེར་སྤྱི་བོར་བླ་རེ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Atiyaśas, when the wife of a merchant, Offered a canopy to be placed over the head To the thus-gone Radiant Mountain And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྟོབས་ལྷ་གྲོང་ཁྱེར་རྟེན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་ཞལ་དེ་ལ། །བཤོས་དྲོན་ལྷུང་བཟེད་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Baladeva, when a city beggar, Offered an alms bowl filled with hot food To the thus-gone Moon Face And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཕྲེང་ལྡན་གྱིས། །དེ་བཞིན་གཤེགས་པ་བསྒྱིངས་ལྡན་བཞུད་དེ་ལ། །སངས་རྒྱས་ཕྱག་འཚལ་ཐལ་མོ་ལན་གསུམ་སྦྱར། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Guṇamālin Joined his palms three times in homage to the Buddha Before the thus-gone Striding Departure And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཀླུ་ལག་གྲོང་ཁྱེར་གྱི། །སྒོ་སྲུངས་ཚེ་ན་ཕྱག་དར་བྱས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་ཕྱོགས་རྣམས་ལྟ་དེ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Nāgabhuja, when a guardian of a city gate, Swept the ground Before the thus-gone Looking in All Directions And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མིག་བརྒྱན་རྒྱལ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འོད་དེ་ལ། །ཆུ་དང་སྐྱུ་རུ་ར་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Pratimaṇḍita­locana, when a prince, Offered water and myrobalan fruits To the thus-gone Dharma Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚུལ་ཁྲིམས་གསལ་དེ་སྔ་དྲོ་ཞིག །དེ་བཞིན་གཤེགས་པ་ལེགས་པར་སྦྱངས་པའི་བློས། །དགའ་བས་སངས་རྒྱས་རྗེས་སུ་དྲན་བྱས་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sucīrṇabuddhi, early one morning, Joyfully recollected the buddha, The thus-gone Brilliant Discipline And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཟིལ་གནོན་ཡེ་ཤེས་ཀྱིས། །ངན་འགྲོར་འགྲོ་བ་ཚུལ་ཁྲིམས་ལ་བཀོད་ནས། །དེ་བཞིན་གཤེགས་པ་མཐའ་ཡས་བློ་དེ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Jñānābhibhū Established beings of the lower realms in discipline And so, before the thus-gone Infinite Mind, First gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཐའ་ཡས་སྤྱན་ནི་གོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཐའ་ཡས་གཟུགས་དེ་ལ། །རས་བཅོས་བླ་རེ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Amitalocana, when a clothing merchant, Offered a canopy of fine fabric To the thus-gone Infinite Form And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བདེན་གསུང་ཁྱིམ་བདག་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་བརྟན་དེ་ལ། །མེ་ཏོག་དག་ལས་བྱས་པའི་གདུགས་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Satyabhāṇin, when the son of a householder, Offered a parasol made of flowers To the thus-gone Steadfast Diligence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཉི་འོད་བཅའ་བ་མཁན་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་ཡིས་མཆོད་དེ་ལ། །ལ་དུ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sūryaprabha, when the son of a cook, Offered laḍḍu sweets To the thus-gone Worshiped by Gods And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དེས་བློ་བཟོ་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀུན་ནས་བློ་དེ་ལ། །གདིང་བ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Niyatabuddhi, when an artisan, Offered sitting mats To the thus-gone Universal Mind And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཐའ་ཡས་གཟུགས་ནི་ཤིང་རྟ་མཁན། །གྱུར་ཚེ་དེ་བཞིན་གཤེགས་པ་འོད་ཞི་ལ། །པ་ལ་ཤི་ཀ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Anantarūpa, when a chariot maker, Offered leaves To the thus-gone Serene Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྣམ་པར་སྣང་མཛད་ཁར་བ་མཁན། །གྱུར་ཚེ་བདེ་གཤེགས་མི་ཡི་གཟི་བྱིན་ལ། །མེ་ལོང་གཅིག་ཅིག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vairocana, when a metal worker, Offered a mirror To the well-gone Gift of the Splendor of Humanity And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་ཏོག་ནི་ནོར་བུ་མཁན་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་སྟེགས་བཟང་ལ། །ནོར་བུ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnaketu, when a jeweler, Offered gems To the thus-gone Excellent Staircase of Merit And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཐེ་ཙོམ་སྤངས་པ་རྒྱལ་པོ་ཡི། །བཙུན་མོར་གྱུར་ཚེ་བདེ་གཤེགས་བརྩོན་བརྟན་ལ། །མེ་ཏོག་སྐྱེད་མོས་ཚལ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vigatakāṅkṣa, when the consort of a king, Offered flower gardens To the well-gone Steadfast Diligence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འཇིག་རྟེན་འདས་པ་མ་མི་ཁར། །གྱུར་ཚེ་བདེ་གཤེགས་ཐུབ་པར་གྲགས་དེ་ལ། །དབུ་ཞུ་གཅིག་ཅིག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Lokottīrṇa, when mamikha, Offered a head covering To the well-gone Renowned as a Sage And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དོན་ཡོད་རྣམ་གནོན་མི་མཇེད་བདག །ཚངས་ཚེ་བདེ་གཤེགས་གྲགས་པ་རྒྱལ་མཚན་ལ། །ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་གསོལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Amoghavikramin, when Brahmā Sahāmpati, Requested the turning of the Dharma wheel From the well-gone Banner of Fame And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་རྟོགས་པར་མཛད་པ་པོས། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་འོད་དེ་ལ། །སྤོས་ཀྱི་རི་ལུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vibodhana Offered balls of incense To the thus-gone Light of the Worthy Ones And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མེ་ཏོག་རྒྱལ་མཚན་རྒྱལ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀུན་ནས་གསལ་དེ་ལ། །རྩྭ་ཡིས་བཀབ་པའི་ཁང་བཟངས་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṣpaketu, when a prince, Offered a mansion thatched with grass To the thus-gone Thoroughly Clear And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རི་དབང་རྒྱལ་པོ་འདྲེག་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་ཆེ་དེ་ཡི། །དབུ་སྐྲ་ལེགས་པར་བྲེག་པ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Śailendrarāja, when a barber, Shaved the head Of the thus-gone Great Splendor And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཟི་བརྗིད་ཆེན་པོ་འབྲུ་མར་མཁན། །གྱུར་ཚེ་བདེ་གཤེགས་དགྲ་བཅོམ་མཆོད་འོས་ཀྱི། །གཙུག་ལག་ཁང་དུ་སྤོས་བསྒོས་འབྲུ་མར་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mahātejas, when an oil producer, Offered in a temple oil infused with fragrance To the well-gone Worthy of Worship And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དོན་མཛད་གཟིགས་པ་ཏ་ལ་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དཔལ་གྱི་མཆོག་དེ་ལ། །ལྷང་ཚེར་ལེབ་ལེབ་པོ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Kṛtārthadarśin, when patalba, Offered shining mica To the thus-gone Supreme Glory And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གྲགས་པ་མཐའ་ཡས་འཁོར་ལོས་སྒྱུར་རྒྱལ་ཚེ། །དེ་བཞིན་གཤེགས་པ་དོན་གྲུབ་སེམས་དཔའ་དེ་ལ་ནི། །འཛམ་བུའི་ཆུ་བོའི་གསེར་གྱི་གདུགས་སྟོང་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Amitayaśas, when a universal monarch, Offered one thousand parasols of gold from the Jambu River To the thus-gone Hero of Accomplished Objectives And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ལྷ་ནི་འཛམ་གླིང་གི། །རྒྱལ་པོར་གྱུར་ཚེ་དེ་བཞིན་གཤེགས་པ་དགའས་མཆོད་ལ། །འབྲས་བུའི་སྐྱེད་མོས་ཚལ་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Ratnadeva, when the king of Jambudvīpa, Offered orchard gardens To the thus-gone Worshiped with Joy And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དོན་གནས་མཁྱེན་པ་ཆང་འཚོང་གི། །བུར་གྱུར་ཚེ་ན་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་སྦེད། །སྲང་དུ་གཤེགས་ཚེ་ཐལ་མོ་སྦྱར་ཏེ་ཕྱག་བྱས་ནས། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sthitārtha­jñānin, when the son of an alcohol vendor, Joined his palms in homage Before the thus-gone Thoroughly Hidden as he passed through the street And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བློ་རྫོགས་རྒྱལ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རབ་ཏུ་དང་བ་ལ། །མེ་ཏོག་དག་ལས་བྱས་པའི་གདུགས་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Pūrṇamati, when a prince, Offered a parasol made of flowers To the thus-gone Highest Brightness And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མྱ་ངན་མེད་པ་དཔའ་བོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་སེམས་པ་དེ། །འཇིགས་པ་མེད་པའི་ཚུལ་གྱིས་སྤྱན་དྲངས་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Aśoka, when a hero, Invited without fear The thus-gone Intelligent Mind And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དྲི་མ་བྲལ་བ་ཡིས། །སེམས་ཅན་ཀུན་ལ་ཡུད་ཙམ་བྱམས་བསྒོམས་ནས། །དེ་བཞིན་གཤེགས་པ་ངེས་བྱུང་བློ་དེ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vigatamala Cultivated love for all sentient beings in an instant Before the thus-gone Mind of Renunciation And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་ལྷ་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷུན་པོའི་དབྱངས་དེ་ལ། །བུ་རམ་ཤིང་གི་སྡོང་བུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Brahmadeva, when a forest guard, Offered a sugarcane trunk To the thus-gone Majestic Melody And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ས་ཡི་དབང་ཕྱུག་ནི། །དགེ་སློང་གྱུར་ཚེ་དེ་བཞིན་གཤེགས་པ་པོ། །སྣ་ཚོགས་གསུང་བའི་ཆོས་གདན་བཏིང་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Dharaṇīśvara, when a monk, Prepared a Dharma seat For the thus-gone Diverse Teaching And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མེ་ཏོག་སྤྱན་ནི་རྒྱལ་པོ་ཡི། །མིར་གྱུར་ཚེ་ན་བདེ་གཤེགས་འབྲུག་སྒྲ་ལ། །ཨུད་པལ་དམར་པོ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Kusumanetra, when a royal servant, Offered red utpalas To the well-gone Sound of Thunder And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྣམ་འབྱེས་སྐུ་ནི་བཙོ་བླག་མཁན། །གྱུར་ཚེ་བདེ་གཤེགས་འོད་ཆེན་ཕུང་པོ་ཡི། །ན་བཟའ་དག་ནི་བཀྲུ་བཤལ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vibhaktagātra, when a dyer, Washed the clothing Of the well-gone Masses of Light And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་འོད་ཀྱིས་ནི་གྲོང་དག་དང་། །ཡུལ་འཁོར་རྣམས་སུ་ཕ་རོལ་ཕྱིན་དྲུག་སྒྲ་བསྒྲགས་ནས། །དེ་བཞིན་གཤེགས་པ་དཔལ་ནི་བརྩེགས་པ་དེ་ལ་ཡང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Dharmaprabhāsa Taught the six perfections throughout towns and lands Before the thus-gone Glorious Peak And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཀུན་གཟིགས་སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བའི་ཚེ། །གཙུག་ལག་ཁང་མཆོག་བྱེ་བ་དྲུག་ཅུ་བྱེད་བཅུག་ནས། །དེ་བཞིན་གཤེགས་པ་མྱ་ངན་མེད་པར་དགའ་དེ་ལ། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Nikhiladarśin, when a universal monarch of strength, Constructed six hundred million supreme monastic residences Before the thus-gone Delighting in Freedom from Sorrow And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་འོད་གསལ་ཕྱག་དར་པར། །གྱུར་ཚེ་བདེ་གཤེགས་ཡུལ་འཁོར་ལྷ་དེ་ལ། །རྡོ་ལེབ་གདན་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇaprabhāsa, when a sweeper, Offered stone slabs as seats To the well-gone God of the Land And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་ཞལ་བྲམ་ཟེའི་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་སེང་གེ་དགའ་བའི་དབྱངས་དེ་ལ། །ཀན་ཏ་ར་ཡི་མེ་ཏོག་དག་ནི་གཏོར་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Śaśivaktra, when the son of a brahmin, Scattered kāntāra flowers Before the thus-gone Lion of Joyous Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་འོད་ནི་དེད་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་འོད་མཐའ་ཡས་དེ་ལ། །རིན་པོ་ཆེ་ཡི་སྒྲོན་མ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnaprabha, when a captain, Offered a jewel lamp To the thus-gone Infinite Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་ཏོག་ནི་ལྕགས་མགར་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཐོང་ན་དགའ་དེ་ལ། །ལྗགས་བཞར་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnaketu, when a blacksmith, Offered a tongue scraper To the thus-gone Delightful to See And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་གྲགས་བླ་ཆང་ཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྒྲོན་མའི་རྒྱལ་པོ་ལ། །འཛམ་བུའི་རོ་བྲོ་བ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Yaśottara, when an alcohol vendor, Offered jambu fruit juice To the thus-gone Royal Lamp And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་བྱེད་ཚོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་དཔལ་གྱི་ཏོག་དེ་ལ། །མུ་ཤི་ཀག་ཤའི་མེ་ཏོག་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Prabhākara, when a merchant’s son, Scattered muśikaka flowers Before the thus-gone Crest of Glory And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཟི་བརྗིད་དཔག་མེད་ཕྲེང་རྒྱུད་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཕྱོགས་སུ་རྣམ་གྲགས་ལ། །པད་མ་འདབ་བརྒྱ་པ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Amitatejas, when a garland maker, Offered lotus flowers with one hundred petals To the thus-gone Universally Renowned And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དུས་མཁྱེན་གོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྤྱན་སྡུག་དེ་ལ་ནི། །རས་ཡུག་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Velāma, when a garment merchant, Offered a length of cotton fabric To the thus-gone Lovely Eyes And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་གེའི་སྐུ་ནི་སྤོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་ཏོག་དེ་ལ། །སྤོས་ཀྱི་ཕུར་མ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃhagātra, when an incense merchant, Offered fragrant powders To the thus-gone Moon Crest And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཁས་བློ་ཚོང་དཔོན་ཁོལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་འཇིགས་མེད་སྦྱིན་དེ་ལ། །མེ་ཏོག་ཆུན་པོ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vidumati, when the servant of a merchant, Offered a bouquet of flowers To the thus-gone Gift of Fearlessness And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་རྒྱལ་དཀའ་ལྷའི་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྒྱུ་སྐར་རྒྱལ་པོ་ལ། །མེ་ཏོག་མན་དཱ་ར་བ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Durjaya, when a divine son, Offered mandārava flowers To the thus-gone Star King And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཕུང་པོ་ནི། །སཱལ་ཆེན་ལྟ་བུའི་བྲམ་ཟེའི་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བ་ལྷ་དེ་ལ། །ཕྲེང་ཕུལ་དང་པོར་བྱང་ཆུབ་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Guṇaskandha, when the son of a prosperous brahmin, Offered a garland To the thus-gone Moon God And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་ཏོག་སྤོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཉི་མའི་འོད་དེ་ཡི། །ཁང་པ་བརྩེགས་པར་སྤོས་བྱུག་ཕྱིར་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Śaśiketu, when an incense merchant, Offered incense fumes within the multistoried mansion Of the thus-gone Sunlight And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མཐུ་ཐོབ་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་གྲགས་པ་ཆེ་དེ་ལ། །དགུན་ཤིང་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sthāmaprāpta, when a forest guard, Offered grapes To the thus-gone Great Fame And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཐུ་རྩལ་མཐའ་ཡས་ཚོང་དཔོན་གྱི། །བུ་ཚེ་དེ་བཞིན་གཤེགས་པ་འཇམ་དབྱངས་ལ། །སེ་འབྲུ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Anantavikrāmin, when the son of a merchant, Offered pomegranates To the thus-gone Gentle Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཟླ་བ་བྲམ་ཟེའི་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྟོན་པར་དགྱེས་དེ་ལ། །ཨུད་པལ་ཆང་པ་གང་ཞིག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Candra, when a brahmin’s son, Offered a handful of utpalas To the thus-gone Delighting in Teaching And in doing so first gave rise to the mind of awakening.
